[
  {
    "fullName": "Daniel Motzev",
    "position": "Lead DevOps at anwalt.de",
    "date": "February 20, 2024",
    "body": "When I joined anwalt.de, Jonas very quickly (I believe it was in the first day or two) stood out from the rest of my new colleagues as a strongly goal oriented, let's-cut-through-the-nonsense professional. He and I quickly and easily agreed to maintain very direct and transparent communication for the sake of both speed and clarity of collaboration.\n\nIt wouldn't be appropriate for me to comment on Jonas's programming skills, but I can vouch for his experience with both my hands. He doesn't look into flashy and fancy solutions, but always puts functionality, maintainability and performance first - the cool and trendy stuff, if fitting the picture, is considered a good bonus on top, but not the main focus for him. Speaking from the perspective of DevOps and Infrastructure, such an attitude is pure gold - not because modern solutions and approaches to solving problems are bad, but because they aren't always mature enough. Jonas won't let something fitting this description slip through and make everyone's life a living nightmare!\n\nAlthough considerately outspoken and vocal, I also find Jonas an introspective and quite self-aware expert. When entering a topic or an area he's not deeply familiar with, he would always start with an open disclaimer about it and would respectively tag his comments as ideas, rather than instructions to solving a problem. The latter would in fact be a sensible description of his style of work altogether - he doesn't impose his thoughts and suggestions, no matter how good these are, but always discussed them with his colleagues to reach the most optimal solution and implementation possible.\n\nAll this said, I can't skip the fact Jonas and I have (naturally, I would say) had our disagreements and heated discussions, but it has always been at a very professional level. He's simply not the type of person who would put up with something that's either not working well or is overly complicated to deal with - rest assured, he'd speak up his mind! Which is even more of a reason for me to recommend Jonas as an excellent colleague, whom one can truly only appreciate working with.",
    "image": "daniel-motzev.jpeg"
  },
  {
    "fullName": "Dr. Tarik El Bouyahyani",
    "position": "Project manager at anwalt.de",
    "date": "January 8, 2024",
    "body": "Working with Jonas was always a pleasure, professionally and personally. \n\nI can't remember a single workshop or scrum meeting where Jonas very sharp mind, extensive IT experience and backgorund, as well as his ability to think outside of the box have not significantly contributed to the discussion or the results. Jonas is definitely not afraid to speak his mind, take on challanges and display great leadership.\n\nI really valued working together with him and if you're looking to boost your IT and development capabilities, definitely reach out to Jonas!",
    "image": "tarik-el-bouyahyani.jpeg"
  },
  {
    "fullName": "Bianca Della Rosa",
    "position": "Frontend Engineer at anwalt.de",
    "date": "January 5, 2024",
    "body": "I recommend Jonas, acknowledging not only the commendable recommendations he has received, with which I totally agree, but also based on the fortunate circumstance of having him as the closest colleague during my onboarding phase. \nHis willingness to interrupt his work to provide support, offering patient explanations and assistance during the initial stages, underscores the great value he brings. \n\nJonas exhibits not only as a highly capable professional but also as a dedicated team player, making him an ideal person to any collaborative environment.",
    "image": "bianca-della-rosa.jpeg"
  },
  {
    "fullName": "Osman Turan",
    "position": "Full Stack Developer at anwalt.de",
    "date": "December 29, 2023",
    "body": "Jonas was one of the greatest team members I've ever worked with. He has extensive knowledge covering full stack software development and DevOps practices. Jonas is a patient team member and team lead who is always available with high quality solution in case of any help. \n\nDuring his time at anwalt.de Jonas was able to enhancing the quality and scalability from the whole platform in collaboration with multiple cross functional teams. What stands out most about Jonas is his incredible way to communicate and explain difficult problems to different stakeholders.",
    "image": "osman-turan.jpeg"
  },
  {
    "fullName": "Roman Iudin",
    "position": "Lead Software Engineer at anwalt.de",
    "date": "December 25, 2023",
    "body": "It has been my honor to work alongside Jonas for over two years. In this time, I’ve seen him excel as a highly competent engineer. He has extensive knowledge covering areas from software development to DevOps practices. What stands out most about Jonas is his attitude to work, which rarely can be found, and his commitment to quality. His proactive attitude and attention to detail have significantly enhanced our project structures. \n\nJonas played a crucial role in implementing significant enhancements to our projects and has played a pivotal role in enhancing the CI/CD pipelines in collaboration with the DevOps team for several projects.\n\nI strongly recommend Jonas not only as a highly capable professional but also as a dedicated team player. He is a professional who I believe will greatly contribute to and strengthen any team he joins.",
    "image": "roman-iudin.jpeg"
  },
  {
    "fullName": "Hans Kreuger",
    "position": "Frontend Developer at anwalt.de",
    "date": "December 22, 2023",
    "body": "I have been working with Jonas for the last three years. He is a most knowledgable developer, has deep insights in advanced programming and has the ability to set up and work with complex data stuctures. Apart from his programming skills, Jonas also proved to be a great problem solver and he is always willing to help others out. It has been a pleassure to work together with him.",
    "image": "hans-kreuger.jpeg"
  },
  {
    "fullName": "Simon Sattes",
    "position": "Head of Architecture at anwalt.de",
    "date": "December 22, 2023",
    "body": "Jonas is a doer and one of those developers you really want to have in your company. He is actually a developer, devops, team lead and tech lead all rolled into one. He has in-depth knowledge and experience in so many areas and tools that it is no problem for him to find solutions for very extensive and tricky tasks across the entire tech stack. Driving projects forward and leading teams to success is part of his DNA. The very pleasant, constructive collaboration with Jonas was always fruitful and productive, and his commitment and passion are an asset to any company.",
    "image": "simon-sattes.jpeg"
  },
  {
    "fullName": "Milan Ristic",
    "position": "Software Engineer at anwalt.de",
    "date": "December 22, 2023",
    "body": "I am pleased to provide a strong recommendation for Jonas Petrik as a Team Lead Software Developer. Throughout our collaboration, Jonas consistently demonstrated exceptional qualities that significantly contributed to the success of our projects.\n\nJonas has proven to be an invaluable asset to the team, showcasing a remarkable ability to foster good teamwork and rapidly find optimal solutions for complex problems. His open and transparent communication style has been instrumental in preventing confusion and ensuring that important topics are effectively addressed.\n\nDespite facing numerous challenges and complex undertakings, Jonas has consistently led the team to successful outcomes. His deep understanding of the full development cycle and knowledge of the correct steps to take have been key factors in overcoming obstacles and achieving project goals.\n\nJonas's commitment to staying abreast of the latest tools, frameworks, and methodologies reflects his dedication to excellence. He consistently strives to incorporate modern technologies, ensuring that our projects benefit from the most up-to-date and effective solutions.",
    "image": "milan-ristic.jpeg"
  },
  {
    "fullName": "Andrei Lungu",
    "position": "Senior Software Engineer at anwalt.de",
    "date": "October 10, 2023",
    "body": "I had the pleasure of working closely with Jonas for almost two years at Anwalt.de. He is a highly talented and dedicated professional who consistently impressed me with his skills and work ethic.\nJonas possesses a deep knowledge of PHP, MySQL, Elasticsearch, REST API design, CI/CD, Kubernetes and more other. He was always willing to share that knowledge with the team. He is an excellent problem solver and never shies away from taking on challenging tasks.\n\nI have no doubt that Jonas will excel in any future endeavors he pursues. He is not only a great colleague but also a wonderful person to work with. I highly recommend him and would welcome the opportunity to work together again in the future.",
    "image": "andrei-lungu.jpeg"
  },
  {
    "fullName": "Martin Will",
    "position": "CTO at anwalt.de",
    "date": "September 21, 2023",
    "body": "Jonas is not only somebody nice to work with - he's also somebody who can bring in new aspects and also implement it. He has a very up2date and good technical understanding and can also lead teams in a very good way due to his Scrum Master knowledge. I really enjoyed working with him.",
    "image": "martin-will.jpeg"
  },
  {
    "fullName": "Gintarė Kaubrytė",
    "position": "Scrum Master at SOLUTIONLAB PRODUCTION",
    "date": "December 14, 2020",
    "body": "I had a pleasure to work with Jonas together in a project and it was a wonderful journey together. Jonas is one of the most responsible persons I have ever met during my work experience. He has an outstanding knowledge in software development field, always prepared to help and lead the team in any way and share his experience with others. While being a team lead Jonas demonstrated good collaboration, planning, problem solving and sharp mind skills. He was one of the team members to whom you can go with any problem, question and get an instant help or direction on how to solve it. What I liked the most about him, that he is result-oriented and strives for best quality of the product/project and leads the team to achieve best results in a given situation. Jonas would be a great team lead to any team or project, strongly recommend!",
    "image": "gintare-kaubryte.jpeg"
  },
  {
    "fullName": "Henrikas Antanas Girdzijauskas",
    "position": "Machine Learning Engineer at AAI Labs",
    "date": "November 28, 2020",
    "body": "I'd like to recommend Jonas as an excellent software engineer and a great leader. I've had the opportunity to work under his leadership for quite some time and can confirm that he is knowledgeable, a true problem solver and always willing to help out.",
    "image": "henrikas-girdzijauskas.jpeg"
  },
  {
    "fullName": "Juste Urbanaviciene",
    "position": "Senior Management Coordinator | Retail Investment Tribe",
    "date": "November 26, 2020",
    "body": "I had the pleasure of working together with Jonas. Jonas is a great leader! He's hardworking, motivated, forward-thinking and has lots of knowledge in his field. Jonas is innovative, organized as well as helpful and is always open to ideas and suggestions. ",
    "image": "juste-urbanaviciene.jpeg"
  },
  {
    "fullName": "Antonina Stoliarova",
    "position": "QA Engineer",
    "date": "November 26, 2020",
    "body": "I'm glad I had the opportunity to work with Jonas. He is smart, polite, result-oriented, a great leader. The biggest advantage of Jonas is his ability to manage sudden events smoothly. I would like to thank him for the work together and I highly recommend him as a professional and a good person.",
    "image": "antonina-stoliarova.jpeg"
  },
  {
    "fullName": "Aleksandr Šmailov",
    "position": "Technical Lead at SOLUTIONLAB PRODUCTION",
    "date": "November 25, 2020",
    "body": "I have a very high opinion of Jonas. His professional mindset, deep knowledge of software development practices, and team-leading skills are a great asset to any serious team.\n\nHere is a list of his key qualities:\n - flexible\n - result-oriented\n - professional\n - friendly and helpful\n - great leader\n - extremely knowledgeable in all the sides of software development",
    "image": "aleksandr-smailov.jpeg"
  },
  {
    "fullName": "Marius Zaleskis",
    "position": "React/Laravel developer, team lead.",
    "date": "April 14, 2020",
    "body": "It was a pleasure to cooperate with Jonas. Product oriented solutions, flexible mindset was the strongest Jonas side as a team leader. Wide and up to date software knowledge, professional attitude helped the team to tackle all kind of problems. Together we made a lot of progress towards product quality. This wouldn't be possible without the ability to wisely manage the resources and fluently communicate to each other. All of this made the team productive and strongly positive. Well done!",
    "image": "marius-zaleskis.jpeg"
  },
  {
    "fullName": "Karolina Rupšienė",
    "position": "Frontend Developer at Wix.com",
    "date": "August 2, 2019",
    "body": "I had an opportunity to work in a team led by Jonas for more than a year. I was impressed by his fast decision making and exceptional problem solving skills. As a team lead, Jonas was fostering collaboration, was confident in his team and was always sharing his knowledge with others. He consistently demonstrated positive attitude and ability to manage unforeseen events smoothly. It was a pleasure to work with him.",
    "image": "karolina-rupsiene.jpeg"
  },
  {
    "fullName": "Donatas Maikštėnas",
    "position": "Frontend Developer",
    "date": "December 23, 2016",
    "body": "It was a pleasure to work with Jonas. He was a great team leader who had a sixth sense for his teammates. The biggest advantage of Jonas is his ability to complete all the tasks even if he would be on a strict schedule. Jonas had knowledge of how to lead and motivate a team. \nHis professionalism amazed me and made me realize how should a real leader look like. I would like to thank him for an extraordinary time while working together.",
    "image": "donatas-maikstenas.jpeg"
  },
  {
    "fullName": "Rytis Grincevičius",
    "position": "Web Application Developer",
    "date": "December 23, 2016",
    "body": "Jonas and I worked together for a year. \nI thoroughly enjoyed my time working with Jonas, and came to know him as a truly valuable asset to absolutely any team. He is honest, dependable, and incredibly hard-working. Beyond that, he is an impressive back-end programmer, team leader and project manager who is always carries work to the end even when clients themselves doesn't know what kind of project they want.",
    "image": "rytis-grinevicius.jpeg"
  },
  {
    "fullName": "Arnoldas Starkauskas",
    "position": "Software Engineer at Swedbank Lietuvoje",
    "date": "December 22, 2016",
    "body": "Jonas is great team-lead who cares not only about the job being done, but also about his team as well. He is smart, responsible and tough as a team leader and caring and motivating as a friend at the same time. If you deserve a good word for a job well done - you are most likely to hear it from Jonas as he understands your input for the project and appreciates it.",
    "image": "arnoldas-starkauskas.jpeg"
  },
  {
    "fullName": "Aleksei Golda",
    "position": "Software Engineer",
    "date": "December 21, 2016",
    "body": "For me it was a great pleasure to work with Jonas. \nDuring my work with him, Jonas showed himself as a talented team leader, programmer and demonstrated a systematic approach to work. Thanks to him I got invaluable experience and raised the level of my programming skills. Always polite, so it is a great pleasure to communicate with him. I highly recommend him as a good person and a wonderful professional.",
    "image": "aleksei-golda.jpeg"
  },
  {
    "fullName": "Дмитрий Скоробогатов",
    "position": "Инженер-программист – АО «ЕЭТП» (Unified Electronic Trading Platfrom)",
    "date": "December 21, 2016",
    "body": "I worked under the leadership of Jonas in the Inlusion Netforms company. During our cooperation, Jonas proved himself as a smart and experienced team leader and project manager. I would be happy to continue working with him.",
    "image": "dimitrij-skorobatov.jpeg"
  },
  {
    "fullName": "Eugene Bunin",
    "position": "Backend developer: PHP|Golang",
    "date": "December 21, 2016",
    "body": "I'm glad i had experience working with Jonas. He is very professional, smart and i liked him not only as my team leader but as well as software engineer. I'm thankful for his help with my integration to the team.",
    "image": "eugene-bunin.jpeg"
  },
  {
    "fullName": "Dmitry Sergiets",
    "position": "Senior Team Lead at АО «ЕЭТП» (Unified Electronic Trading Platfrom)",
    "date": "December 21, 2016",
    "body": "I was really impressed by Jonas Petrikas ability to inspire and motivate teamwork for achieving goals (mostly by skype). \n \nMost of his decisions accelerated workflow and helping to carry out the tasks on time. He is always open to a new ideas coming from team members, and help with solving any kind of problem with ease. \n \nSo, without any doubt i can say that Jonas Petrikas is a great team leader and professional of the business.",
    "image": "dmitry-sergiets.jpeg"
  }
]
